
/*
Од стандарден влез се читаат N цели броеви. 
Да се напише програма која за секој прочитан број ќе ги отпечати на стандарден излез само цифрите помали од 5, 
како и бројот на цифри кои се отпечатени. 
Печатењето на цифрите помали од 5 да се реализира со посебна рекурзивна функција.

Пример:

за бројот 8423871 треба да се отпечати 4231 : 4

*/


#include <stdio.h>

int print4(int n) {
    if(n == 0) return 0;
   
    int r = print4(n / 10);
    
    int c = n % 10;
    
    if(c < 5) {
        printf("%d", c);
        return r + 1;
	}
    
    return r;
}

int main() {
    int n;
    scanf("%d", &n);
    int i;
    for(i = 0; i < n; ++i) {
        int x;
        scanf("%d", &x);
        int r = print4(x);
        printf(" : %d\n", r);        
    }
    return 0;
}